itdogwowo/mp_lcd_bus/esp32_src/dsi_bus.c
    mp_lcd_dsi_bus_obj_t *self = m_new_obj(mp_lcd_dsi_bus_obj_t);
    memset(self, 0, sizeof(*self));
    self->base.type = &mp_lcd_dsi_bus_type;
    self->lane_count = lanes;
    self->panel_w = args[ARG_width].u_int;
    self->panel_h = args[ARG_height].u_int;
    self->reset_pin = args[ARG_rst].u_int;
    self->bits_per_pixel = bpp;
    self->num_fbs = nfbs;
    self->fb_size = (size_t)self->panel_w * self->panel_h * bpp / 8;
    self->queue_depth = qdepth;

    esp_err_t ret;

    esp_lcd_dsi_bus_config_t bc = {
        .bus_id = 0,
        .num_data_lanes = (uint8_t)lanes,
        .phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT,
        .lane_bit_rate_mbps = mp_obj_get_float(args[ARG_lane_bit_rate_mbps].u_obj),
    };
    ret = esp_lcd_new_dsi_bus(&bc, &self->bus_handle);
    if (ret != ESP_OK) goto err_bus;

    esp_lcd_dbi_io_config_t dbi = {
        .virtual_channel = (uint8_t)args[ARG_virtual_channel].u_int,
        .lcd_cmd_bits = (uint8_t)args[ARG_cmd_bits].u_int,
        .lcd_param_bits = (uint8_t)args[ARG_param_bits].u_int,
    };
    ret = esp_lcd_new_panel_io_dbi(self->bus_handle, &dbi, &self->dbi_io);
    if (ret != ESP_OK) goto err_bus;

    float dpi_clk_mhz = 30.0f;
    if (args[ARG_dpi_clk_mhz].u_obj != MP_OBJ_NULL)
        dpi_clk_mhz = mp_obj_get_float(args[ARG_dpi_clk_mhz].u_obj);

    esp_lcd_dpi_panel_config_t dc = {
        .virtual_channel = (uint8_t)args[ARG_virtual_channel].u_int,
        .dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT,
        .dpi_clock_freq_mhz = dpi_clk_mhz,
        .pixel_format = (bpp == 24) ? LCD_COLOR_PIXEL_FORMAT_RGB888 : LCD_COLOR_PIXEL_FORMAT_RGB565,
        .in_color_format = (bpp == 24) ? LCD_COLOR_FMT_RGB888 : LCD_COLOR_FMT_RGB565,
        .num_fbs = (uint8_t)nfbs,
        .video_timing = {
            .h_size = (uint32_t)self->panel_w,
            .v_size = (uint32_t)self->panel_h,
            .hsync_pulse_width = (uint32_t)args[ARG_hsync_pulse_width].u_int,
            .hsync_back_porch  = (uint32_t)args[ARG_hsync_back_porch].u_int,
            .hsync_front_porch = (uint32_t)args[ARG_hsync_front_porch].u_int,
            .vsync_pulse_width = (uint32_t)args[ARG_vsync_pulse_width].u_int,
            .vsync_back_porch  = (uint32_t)args[ARG_vsync_back_porch].u_int,
            .vsync_front_porch = (uint32_t)args[ARG_vsync_front_porch].u_int,
        },
        .flags = {
            .use_dma2d = args[ARG_use_dma2d].u_bool,
        },
    };
    ret = esp_lcd_new_panel_dpi(self->bus_handle, &dc, &self->dpi_panel);
    if (ret != ESP_OK) goto err_io;

    // grab the internal frame buffers (allocated by the driver in PSRAM)
    // note: fb_num must match the number of output pointers passed
    void *fb0 = NULL, *fb1 = NULL, *fb2 = NULL;
    if (esp_lcd_dpi_panel_get_frame_buffer(self->dpi_panel, (uint32_t)nfbs, &fb0, &fb1, &fb2) != ESP_OK)
        goto err_panel;
    self->fbs[0] = fb0;
    self->fbs[1] = fb1;
    self->fbs[2] = fb2;

    esp_lcd_dpi_panel_event_callbacks_t cbs = {
        .on_color_trans_done = on_color_trans_done,
        .on_refresh_done     = on_refresh_done,
    };
    ret = esp_lcd_dpi_panel_register_event_callbacks(self->dpi_panel, &cbs, self);
    if (ret != ESP_OK) goto err_panel;

    // optional hardware reset for the panel
    // (esp_lcd DPI panel has no reset_gpio support, so we manage it manually)
    if (self->reset_pin >= 0) {
        gpio_config_t gc = {
            .mode = GPIO_MODE_OUTPUT,
            .pin_bit_mask = 1ULL << self->reset_pin,
        };
        gpio_config(&gc);
        gpio_set_level(self->reset_pin, 0);
        mp_hal_delay_ms(20);
        gpio_set_level(self->reset_pin, 1);
        mp_hal_delay_ms(50);
    }

    // Note: esp_lcd_panel_reset() is NOT called — DPI panel driver doesn't
    // register a .reset callback and would return ESP_ERR_NOT_SUPPORTED.
    // The hardware reset above (if rst>=0) is the only reset mechanism.
    ret = esp_lcd_panel_init(self->dpi_panel);
    if (ret != ESP_OK) goto err_panel;

    memset(self->ref_bufs, 0, sizeof(self->ref_bufs));
    memset(self->done_flags, 0, sizeof(self->done_flags));
    memset(self->pending_segments, 0, sizeof(self->pending_segments));
    memset(self->slot_kind, 0, sizeof(self->slot_kind));
    self->queue_head = self->queue_tail = self->queue_count = 0;
    self->cur_fb = 0;       // fb0 為初始顯示中; back_buffer()/present() 用 1-cur_fb 選離屏
    // 視窗預設全螢幕, 流式位置從 (0,0) 開始
    self->win_x0 = self->win_y0 = 0;
    self->win_x1 = self->panel_w - 1;
    self->win_y1 = self->panel_h - 1;
    self->pos_x = self->pos_y = 0;
    self->initialized = true;

    s_last_dsi = self;

    return MP_OBJ_FROM_PTR(self);

err_panel:
    // ⚠ 修復：reset GPIO 已被配置為 OUTPUT，錯誤路徑需釋放回 INPUT
    if (self->reset_pin >= 0) {
        gpio_config_t gc = {
            .mode = GPIO_MODE_INPUT,
            .pin_bit_mask = 1ULL << self->reset_pin,
        };
        gpio_config(&gc);
    }
    if (self->dpi_panel) esp_lcd_panel_del(self->dpi_panel);
err_io:
    if (self->dbi_io) esp_lcd_panel_io_del(self->dbi_io);
err_bus:
    // ⚠ 修復：esp_lcd_new_dsi_bus 失敗時 bus_handle 為 NULL，直接 del 會 assert/crash
    if (self->bus_handle) esp_lcd_del_dsi_bus(self->bus_handle);
    m_del_obj(mp_lcd_dsi_bus_obj_t, self);
    mp_raise_msg_varg(&mp_type_RuntimeError, MP_ERROR_TEXT("DSI init failed err=0x%x"), ret);
}


static mp_obj_t dsi_write(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_self, ARG_buf, ARG_x, ARG_y, ARG_w, ARG_h };
    static const mp_arg_t allowed[] = {
        { MP_QSTR_self, MP_ARG_OBJ | MP_ARG_REQUIRED },
        { MP_QSTR_buf,  MP_ARG_OBJ | MP_ARG_REQUIRED },
        // 統一 API: x/y/w/h 是舊式顯式區域 (保留向後相容)。
        // 新用法: set_window() 設定視窗後 write(buf) 流式寫入。
        { MP_QSTR_x,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
        { MP_QSTR_y,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
        { MP_QSTR_w,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
        { MP_QSTR_h,    MP_ARG_INT | MP_ARG_KW_ONLY, {.u_int = -1} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed), allowed, args);

    mp_lcd_dsi_bus_obj_t *self = (mp_lcd_dsi_bus_obj_t *)args[ARG_self].u_obj;
    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(args[ARG_buf].u_obj, &bufinfo, MP_BUFFER_READ);

    // ⚠ deinit 後 dpi_panel 為 NULL，直接使用會 use-after-free
    if (self->dpi_panel == NULL) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("bus deinitialized"));
    }
    if (self->queue_count >= self->queue_depth)
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("queue full"));

    int idx = self->queue_tail;
    self->ref_bufs[idx] = args[ARG_buf].u_obj;
    self->done_flags[idx] = false;

    bool explicit_region = (args[ARG_x].u_int != -1 || args[ARG_y].u_int != -1 ||
                            args[ARG_w].u_int != -1 || args[ARG_h].u_int != -1);

    int bpp = self->bits_per_pixel / 8;    // bytes per pixel
    size_t px_total = bufinfo.len / (size_t)bpp;   // 可寫像素數 (尾巴忽略)

    // 段表: 流式 write 可能跨行, 每段 = 一行內的矩形 DMA2D 拷貝。
    // 段數上限 = 視窗行數 (每段至少 1 像素/行) — 動態算, 用大一點的靜態陣列。
    #define DSI_MAX_SEGS 600
    int seg_x[DSI_MAX_SEGS], seg_y[DSI_MAX_SEGS], seg_w[DSI_MAX_SEGS], seg_h[DSI_MAX_SEGS];
    int nsegs = 0;

    if (explicit_region) {
        // ── 舊式顯式區域: 一次拷貝, 不影響視窗/位置狀態 ──
        int x = args[ARG_x].u_int;
        int y = args[ARG_y].u_int;
        int w = args[ARG_w].u_int;
        int h = args[ARG_h].u_int;
        if (x == -1) x = 0;
        if (y == -1) y = 0;
        if (w == -1 || w == 0) w = self->panel_w - x;
        if (h == -1 || h == 0) h = self->panel_h - y;
        // clip 到面板範圍
        if (x < 0) x = 0;
        if (y < 0) y = 0;
        if (x + w > self->panel_w) w = self->panel_w - x;
        if (y + h > self->panel_h) h = self->panel_h - y;
        if (w > 0 && h > 0 && px_total > 0) {
            seg_x[0] = x; seg_y[0] = y;
            seg_w[0] = w; seg_h[0] = h;
            nsegs = 1;
        }
    } else {
        // ── 流式模式: 從視窗內 pos 開始寫, 逐段前進 (面板 RAMWR 模型) ──
        // 分段策略: 行首對齊且剩餘 ≥ 一整行 → 合併成矩形 (全螢幕 = 1 段,
        // 一次 DMA2D); 行中開始 → 寫到行尾 (1 行)。避免逐行分段拖垮吞吐。
        size_t px_left = px_total;
        int px = self->pos_x;
        int py = self->pos_y;
        int region_w = self->win_x1 - self->win_x0 + 1;
        int region_h = self->win_y1 - self->win_y0 + 1;
        while (px_left > 0) {
            if (py > self->win_y1) {
                // 寫滿視窗 → 自動 wrap 回視窗起點 (連續整幀/分批輸入天然成立)
                px = self->win_x0;
                py = self->win_y0;
            }
            int row_left = self->win_x1 - px + 1;  // 本行剩餘像素
            if (row_left <= 0) {                   // 行尾換行
                px = self->win_x0;
                py++;
                continue;
            }
            size_t n_px;
            int seg_h_ = 1;
            if (px == self->win_x0 && px_left >= (size_t)region_w) {
                // 行首 → 合併完整行成矩形 (不超過視窗底部)
                size_t n_rows = px_left / (size_t)region_w;
                int rows_avail = region_h - (py - self->win_y0);
                if ((size_t)rows_avail < n_rows) n_rows = rows_avail;
                if (n_rows == 0) n_rows = 1;       // 至少一行
                n_px = n_rows * (size_t)region_w;
                seg_h_ = (int)n_rows;
            } else {
                // 行中開始 (或剩餘不足一行) → 寫到行尾
                n_px = px_left;
                if (n_px > (size_t)row_left) n_px = row_left;
            }
            if (nsegs < DSI_MAX_SEGS) {
                seg_x[nsegs] = px;
                seg_y[nsegs] = py;
                seg_w[nsegs] = (int)n_px;
                seg_h[nsegs] = seg_h_;
                nsegs++;
            } else {
                break;   // 段表滿 (理論上不會: 每段至少 1 像素/行)
            }
            px += (int)n_px;
            px_left -= n_px;
            if (px > self->win_x1) {
                px = self->win_x0;
                py++;
            }
        }
        // 更新流式位置 (只算已排程的段)
        if (nsegs > 0) {
            self->pos_x = seg_x[nsegs - 1] + seg_w[nsegs - 1];
            self->pos_y = seg_y[nsegs - 1];
            if (self->pos_x > self->win_x1) {
                self->pos_x = self->win_x0;
                self->pos_y++;
            }
        }
    }

    if (nsegs == 0) {
        // 空寫入 (0 像素) — 直接完成
        self->ref_bufs[idx] = mp_const_none;
        self->done_flags[idx] = true;
        self->queue_tail = (self->queue_tail + 1) % self->queue_depth;
        self->queue_count++;
        return mp_obj_new_int(idx + 1);
    }

    self->pending_segments[idx] = nsegs;
    self->queue_tail = (self->queue_tail + 1) % self->queue_depth;
    self->queue_count++;

    // 逐段 DMA2D 拷貝。DSI driver 一次只允許一個 in-flight 拷貝
    // (draw_sem), 所以中間段要等上一段完成才發下一段;
    // 最後一段非同步 (回呼會清 queue 槽)。
    const uint8_t *src = (const uint8_t *)bufinfo.buf;
    size_t src_off = 0;
    for (int k = 0; k < nsegs; k++) {
        size_t seg_bytes = (size_t)seg_w[k] * seg_h[k] * (size_t)bpp;
        esp_err_t ret = esp_lcd_panel_draw_bitmap(
            self->dpi_panel, seg_x[k], seg_y[k],
            seg_x[k] + seg_w[k], seg_y[k] + seg_h[k],
            src + src_off);
        if (ret != ESP_OK) {
            // 失敗: 釋放 queue 槽 (清除剩餘段計數)
            self->pending_segments[idx] = 0;
            self->done_flags[idx] = true;
            self->ref_bufs[idx] = mp_const_none;
            self->queue_head = (self->queue_head + 1) % self->queue_depth;
            self->queue_count--;
            mp_raise_msg_varg(&mp_type_RuntimeError, MP_ERROR_TEXT("draw_bitmap failed err=0x%x"), ret);
        }
        src_off += seg_bytes;
        if (k < nsegs - 1) {
            // 等本段完成 (回呼遞減 pending_segments) 才能發下一段
            int expect = nsegs - (k + 1);
            while (self->pending_segments[idx] > expect) {
                mp_hal_delay_ms(1);
            }
        }
    }
    return mp_obj_new_int(idx + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(dsi_write_obj, 2, dsi_write);


